[
  {
    "id": 1,
    "title": "GYM Website",
    "image": "/IMGS/GYM UI.png",
    "description": "A modern and responsive GYM website developed using the MERN stack (MongoDB, Express.js, React.js, Node.js). This project features a user-friendly interface, real-time data updates, and a fully functional backend. The website is fully deployed on GitHub, showcasing my ability to create dynamic web applications and implement full-stack solutions.",
    "link": "https://gym-management-system-2-6bds.onrender.com",
    "category": "Full Stack"
  },
  {
    "id": 2,
    "title": "Swiggy UI Clone",
    "image": "/IMGS/Swigy UI.png",
    "description": "A Swiggy UI clone developed using the MERN stack (MongoDB, Express.js, React.js, Node.js). This project replicates the user interface and functionality of the popular food delivery service, showcasing my skills in building responsive and interactive web applications. The clone is fully deployed on GitHub, demonstrating my ability to create complex front-end designs and implement backend services.",
    "link": "https://food-delivery-app-88sq.onrender.com/",
    "category": "Full Stack"
  },
  {
    "id": 3,
    "title": "Blog Application",
    "image": "/IMGS/Blog-app.png",
    "description": "A Blog Application developed using the MERN stack (MongoDB, Express.js, React.js, Node.js). This project allows users to create, read, update, and delete blog posts, showcasing my skills in building full-stack web applications. The application is fully deployed on GitHub, demonstrating my ability to implement RESTful APIs and manage user authentication.",
    "link": "https://news-app-xi-neon.vercel.app/",
    "category": "Full Stack"
  },
  {
    "id": 4,
    "title": "Weather App",
    "image": "/IMGS/weather-app.png",
    "description": "A modern and responsive Weather App developed using the MERN stack (Express.js, React.js, Node.js). This project allows users to search for weather information by city, showcasing my skills in building full-stack web applications. The application is fully deployed on GitHub, demonstrating my ability to implement RESTful APIs and manage user authentication.",
    "link": "https://weather-app-nine-beryl-jc9o0bwmb8.vercel.app/",
    "category": "Full Stack"
  },
  {
    "id": 10,
    "title": "Book Finder",
    "image": "/IMGS/Book Finder.png",
    "description": "A Book Finder application developed using React.js and the Open Library API. This project allows users to search for books, view detailed information, and explore a vast collection of books from the Open Library database. The application features a responsive design, real-time search functionality, and an intuitive user interface. Fully deployed on GitHub, it showcases my skills in API integration, React development, and building interactive front-end applications.",
    "link": "https://book-finder-git-master-rabbanis-projects-5dc2f6ba.vercel.app/",
    "category": "Frontend"
  },
  {
    "id": 12,
    "title": "React Todo App",
    "image": "/IMGS/react.todo.png",
    "description": "A modern Todo application built with React.js, featuring task management capabilities with add, edit, delete, and completion tracking. This project demonstrates React state management, component architecture, and responsive design. The app includes local storage for data persistence and a clean, intuitive user interface. Fully deployed on GitHub, it highlights my proficiency in React development and modern JavaScript practices.",
    "link": "https://weather-app-jugo.vercel.app/",
    "category": "Frontend"
  }
]